# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2025-02-18 15:03:08 krylon>
#
#+TAGS: internals(i) ui(u) bug(b) feature(f)
#+TAGS: database(d) design(e), meditation(m)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TAGS: web(w)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* kryLisp [0/0]
  :PROPERTIES:
  :COOKIE_DATA: todo recursive
  :VISIBILITY: children
  :END:
  kryLisp is a simple Lisp interpreter written in Go.
** Clocktable
   #+BEGIN: clocktable :scope file :maxlevel 202 :emphasize t
   #+CAPTION: Clock summary at [2025-02-18 Di 15:03]
   | Headline                | Time   |        |      |
   |-------------------------+--------+--------+------|
   | *Total time*            | *7:12* |        |      |
   |-------------------------+--------+--------+------|
   | *kryLisp [0/0]*         | *7:12* |        |      |
   | \_  /Components [0/1]/  |        | /7:12/ |      |
   | \_    Parser [0/1]      |        |        | 2:33 |
   | \_    Interpreter [0/0] |        |        | 4:39 |
   #+END:
** Features [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
** Components [0/1]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** Parser [0/1]
    :LOGBOOK:
    CLOCK: [2025-02-18 Di 14:41]--[2025-02-18 Di 15:03] =>  0:22
    CLOCK: [2025-02-13 Do 14:44]--[2025-02-13 Do 16:55] =>  2:11
    :END:
    I am going to give Participle a try. In a prior attempt I used gocc, but
    ... I wasn't really happy with it, I don't remember why.
    [2025-02-13 Do 15:44]
    After a long period of procrastination and banging my head against the
    desk I have finally started to understand how participle works and how to
    use it, and now that I am over that hump, I have to say it's pretty nice,
    at least so far.
**** TODO Implement lists to proper single-linked lists
*** Interpreter [0/0]
    :LOGBOOK:
    CLOCK: [2025-02-18 Di 14:36]--[2025-02-18 Di 14:41] =>  0:05
    CLOCK: [2025-02-17 Mo 15:18]--[2025-02-17 Mo 18:02] =>  2:44
    CLOCK: [2025-02-15 Sa 17:34]--[2025-02-15 Sa 18:09] =>  0:35
    CLOCK: [2025-02-15 Sa 15:21]--[2025-02-15 Sa 16:36] =>  1:15
    :END:
** Bugs [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
